{"config": {"input_layers": [["Volume_BTC", 0, 0], ["Bitcoin_Adj", 0, 0], ["Price_lagged", 0, 0]], "layers": [{"name": "Volume_BTC", "inbound_nodes": [], "config": {"dtype": "float32", "name": "Volume_BTC", "sparse": false, "batch_input_shape": [null, 10, 1]}, "class_name": "InputLayer"}, {"name": "Bitcoin_Adj", "inbound_nodes": [], "config": {"dtype": "float32", "name": "Bitcoin_Adj", "sparse": false, "batch_input_shape": [null, 10, 1]}, "class_name": "InputLayer"}, {"name": "Price_lagged", "inbound_nodes": [], "config": {"dtype": "float32", "name": "Price_lagged", "sparse": false, "batch_input_shape": [null, 10, 1]}, "class_name": "InputLayer"}, {"name": "lstm_12", "inbound_nodes": [[["Volume_BTC", 0, 0, {}]]], "config": {"name": "lstm_12", "trainable": true, "bias_constraint": null, "units": 64, "stateful": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "return_sequences": false, "unroll": false, "recurrent_constraint": null, "dropout": 0.0, "go_backwards": false, "bias_regularizer": null, "use_bias": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"name": "lstm_13", "inbound_nodes": [[["Bitcoin_Adj", 0, 0, {}]]], "config": {"name": "lstm_13", "trainable": true, "bias_constraint": null, "units": 64, "stateful": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "return_sequences": false, "unroll": false, "recurrent_constraint": null, "dropout": 0.0, "go_backwards": false, "bias_regularizer": null, "use_bias": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"name": "lstm_14", "inbound_nodes": [[["Price_lagged", 0, 0, {}]]], "config": {"name": "lstm_14", "trainable": true, "bias_constraint": null, "units": 64, "stateful": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "return_sequences": false, "unroll": false, "recurrent_constraint": null, "dropout": 0.0, "go_backwards": false, "bias_regularizer": null, "use_bias": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"name": "concatenate_5", "inbound_nodes": [[["lstm_12", 0, 0, {}], ["lstm_13", 0, 0, {}], ["lstm_14", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_5", "trainable": true}, "class_name": "Concatenate"}, {"name": "IsSpike", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "IsSpike", "trainable": true, "bias_constraint": null, "units": 3, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "activation": "softmax", "kernel_constraint": null}, "class_name": "Dense"}], "output_layers": [["IsSpike", 0, 0]], "name": "model_5"}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.5"}