{"keras_version": "2.0.5", "backend": "tensorflow", "class_name": "Model", "config": {"name": "model_5", "layers": [{"name": "Volume_BTC", "class_name": "InputLayer", "config": {"name": "Volume_BTC", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 10, 1]}, "inbound_nodes": []}, {"name": "Bitcoin_Adj", "class_name": "InputLayer", "config": {"name": "Bitcoin_Adj", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 10, 1]}, "inbound_nodes": []}, {"name": "Price_lagged", "class_name": "InputLayer", "config": {"name": "Price_lagged", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 10, 1]}, "inbound_nodes": []}, {"name": "lstm_10", "class_name": "LSTM", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "unit_forget_bias": true, "name": "lstm_10", "units": 64, "kernel_constraint": null, "use_bias": true, "dropout": 0.0, "activation": "tanh", "recurrent_regularizer": null, "bias_regularizer": null, "return_sequences": false, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_state": false, "stateful": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "unroll": false, "recurrent_dropout": 0.0, "implementation": 0}, "inbound_nodes": [[["Volume_BTC", 0, 0, {}]]]}, {"name": "lstm_11", "class_name": "LSTM", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "unit_forget_bias": true, "name": "lstm_11", "units": 64, "kernel_constraint": null, "use_bias": true, "dropout": 0.0, "activation": "tanh", "recurrent_regularizer": null, "bias_regularizer": null, "return_sequences": false, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_state": false, "stateful": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "unroll": false, "recurrent_dropout": 0.0, "implementation": 0}, "inbound_nodes": [[["Bitcoin_Adj", 0, 0, {}]]]}, {"name": "lstm_12", "class_name": "LSTM", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "unit_forget_bias": true, "name": "lstm_12", "units": 64, "kernel_constraint": null, "use_bias": true, "dropout": 0.0, "activation": "tanh", "recurrent_regularizer": null, "bias_regularizer": null, "return_sequences": false, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_state": false, "stateful": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "unroll": false, "recurrent_dropout": 0.0, "implementation": 0}, "inbound_nodes": [[["Price_lagged", 0, 0, {}]]]}, {"name": "concatenate_5", "class_name": "Concatenate", "config": {"name": "concatenate_5", "trainable": true, "axis": -1}, "inbound_nodes": [[["lstm_10", 0, 0, {}], ["lstm_11", 0, 0, {}], ["lstm_12", 0, 0, {}]]]}, {"name": "IsSpike", "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "name": "IsSpike", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 3, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "use_bias": true, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}], "input_layers": [["Volume_BTC", 0, 0], ["Bitcoin_Adj", 0, 0], ["Price_lagged", 0, 0]], "output_layers": [["IsSpike", 0, 0]]}}