{"keras_version": "2.0.5", "config": {"input_layers": [["Volume_BTC", 0, 0], ["Bitcoin_Adj", 0, 0], ["Price_lagged", 0, 0]], "name": "model_4", "layers": [{"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 10, 1], "name": "Volume_BTC"}, "class_name": "InputLayer", "name": "Volume_BTC", "inbound_nodes": []}, {"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 10, 1], "name": "Bitcoin_Adj"}, "class_name": "InputLayer", "name": "Bitcoin_Adj", "inbound_nodes": []}, {"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 10, 1], "name": "Price_lagged"}, "class_name": "InputLayer", "name": "Price_lagged", "inbound_nodes": []}, {"config": {"stateful": false, "recurrent_constraint": null, "unroll": false, "activation": "tanh", "implementation": 0, "return_sequences": false, "units": 64, "go_backwards": false, "return_state": false, "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "unit_forget_bias": true, "trainable": true, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "dropout": 0.0, "name": "lstm_10"}, "class_name": "LSTM", "name": "lstm_10", "inbound_nodes": [[["Volume_BTC", 0, 0, {}]]]}, {"config": {"stateful": false, "recurrent_constraint": null, "unroll": false, "activation": "tanh", "implementation": 0, "return_sequences": false, "units": 64, "go_backwards": false, "return_state": false, "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "unit_forget_bias": true, "trainable": true, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "dropout": 0.0, "name": "lstm_11"}, "class_name": "LSTM", "name": "lstm_11", "inbound_nodes": [[["Bitcoin_Adj", 0, 0, {}]]]}, {"config": {"stateful": false, "recurrent_constraint": null, "unroll": false, "activation": "tanh", "implementation": 0, "return_sequences": false, "units": 64, "go_backwards": false, "return_state": false, "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "unit_forget_bias": true, "trainable": true, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "dropout": 0.0, "name": "lstm_12"}, "class_name": "LSTM", "name": "lstm_12", "inbound_nodes": [[["Price_lagged", 0, 0, {}]]]}, {"config": {"name": "concatenate_4", "trainable": true, "axis": -1}, "class_name": "Concatenate", "name": "concatenate_4", "inbound_nodes": [[["lstm_10", 0, 0, {}], ["lstm_11", 0, 0, {}], ["lstm_12", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "units": 10, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "weighted_average_output"}, "class_name": "Dense", "name": "weighted_average_output", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}], "output_layers": [["weighted_average_output", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}