{"class_name": "Model", "keras_version": "2.0.5", "backend": "tensorflow", "config": {"output_layers": [["IsSpike", 0, 0]], "input_layers": [["Volume_BTC", 0, 0], ["Bitcoin_Adj", 0, 0], ["Price_lagged", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 10, 1], "name": "Volume_BTC", "dtype": "float32"}, "name": "Volume_BTC"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 10, 1], "name": "Bitcoin_Adj", "dtype": "float32"}, "name": "Bitcoin_Adj"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 10, 1], "name": "Price_lagged", "dtype": "float32"}, "name": "Price_lagged"}, {"class_name": "LSTM", "inbound_nodes": [[["Volume_BTC", 0, 0, {}]]], "config": {"unroll": false, "return_state": false, "activity_regularizer": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "units": 64, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "return_sequences": false, "name": "lstm_6", "recurrent_dropout": 0.0, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "stateful": false, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true}, "name": "lstm_6"}, {"class_name": "LSTM", "inbound_nodes": [[["Bitcoin_Adj", 0, 0, {}]]], "config": {"unroll": false, "return_state": false, "activity_regularizer": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "units": 64, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "return_sequences": false, "name": "lstm_7", "recurrent_dropout": 0.0, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "stateful": false, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true}, "name": "lstm_7"}, {"class_name": "LSTM", "inbound_nodes": [[["Price_lagged", 0, 0, {}]]], "config": {"unroll": false, "return_state": false, "activity_regularizer": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "units": 64, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "return_sequences": false, "name": "lstm_8", "recurrent_dropout": 0.0, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "stateful": false, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true}, "name": "lstm_8"}, {"class_name": "Concatenate", "inbound_nodes": [[["lstm_6", 0, 0, {}], ["lstm_7", 0, 0, {}], ["lstm_8", 0, 0, {}]]], "config": {"trainable": true, "axis": -1, "name": "concatenate_3"}, "name": "concatenate_3"}, {"class_name": "Dense", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"use_bias": true, "bias_constraint": null, "name": "IsSpike", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "softmax", "units": 3, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null}, "name": "IsSpike"}], "name": "model_3"}}