{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.5", "config": {"name": "model_9", "layers": [{"name": "Volume_BTC", "config": {"name": "Volume_BTC", "dtype": "float32", "batch_input_shape": [null, 10, 1], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "Bitcoin_Adj", "config": {"name": "Bitcoin_Adj", "dtype": "float32", "batch_input_shape": [null, 10, 1], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "Price_lagged", "config": {"name": "Price_lagged", "dtype": "float32", "batch_input_shape": [null, 10, 1], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "lstm_25", "config": {"name": "lstm_25", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "go_backwards": false, "units": 64, "stateful": false, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "return_sequences": false, "activity_regularizer": null, "unit_forget_bias": true, "kernel_regularizer": null, "activation": "tanh", "bias_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "return_state": false, "recurrent_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true}, "class_name": "LSTM", "inbound_nodes": [[["Volume_BTC", 0, 0, {}]]]}, {"name": "lstm_26", "config": {"name": "lstm_26", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "go_backwards": false, "units": 64, "stateful": false, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "return_sequences": false, "activity_regularizer": null, "unit_forget_bias": true, "kernel_regularizer": null, "activation": "tanh", "bias_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "return_state": false, "recurrent_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true}, "class_name": "LSTM", "inbound_nodes": [[["Bitcoin_Adj", 0, 0, {}]]]}, {"name": "lstm_27", "config": {"name": "lstm_27", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "go_backwards": false, "units": 64, "stateful": false, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "return_sequences": false, "activity_regularizer": null, "unit_forget_bias": true, "kernel_regularizer": null, "activation": "tanh", "bias_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "return_state": false, "recurrent_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true}, "class_name": "LSTM", "inbound_nodes": [[["Price_lagged", 0, 0, {}]]]}, {"name": "concatenate_9", "config": {"name": "concatenate_9", "axis": -1, "trainable": true}, "class_name": "Concatenate", "inbound_nodes": [[["lstm_25", 0, 0, {}], ["lstm_26", 0, 0, {}], ["lstm_27", 0, 0, {}]]]}, {"name": "IsSpike", "config": {"name": "IsSpike", "kernel_regularizer": null, "bias_regularizer": null, "activation": "softmax", "units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}], "input_layers": [["Volume_BTC", 0, 0], ["Bitcoin_Adj", 0, 0], ["Price_lagged", 0, 0]], "output_layers": [["IsSpike", 0, 0]]}}