{"backend": "tensorflow", "keras_version": "2.0.5", "class_name": "Model", "config": {"name": "model_3", "output_layers": [["weighted_average_output", 0, 0]], "layers": [{"name": "Volume_BTC", "inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "name": "Volume_BTC", "dtype": "float32", "batch_input_shape": [null, 10, 1]}}, {"name": "Bitcoin_Adj", "inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "name": "Bitcoin_Adj", "dtype": "float32", "batch_input_shape": [null, 10, 1]}}, {"name": "Price_lagged", "inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "name": "Price_lagged", "dtype": "float32", "batch_input_shape": [null, 10, 1]}}, {"name": "lstm_7", "inbound_nodes": [[["Volume_BTC", 0, 0, {}]]], "class_name": "LSTM", "config": {"activity_regularizer": null, "unit_forget_bias": true, "trainable": true, "recurrent_dropout": 0.0, "unroll": false, "activation": "tanh", "recurrent_regularizer": null, "bias_regularizer": null, "name": "lstm_7", "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "recurrent_activation": "hard_sigmoid", "use_bias": true, "go_backwards": false, "kernel_constraint": null, "return_sequences": false, "dropout": 0.0, "bias_constraint": null, "stateful": false, "units": 64, "implementation": 0, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"name": "lstm_8", "inbound_nodes": [[["Bitcoin_Adj", 0, 0, {}]]], "class_name": "LSTM", "config": {"activity_regularizer": null, "unit_forget_bias": true, "trainable": true, "recurrent_dropout": 0.0, "unroll": false, "activation": "tanh", "recurrent_regularizer": null, "bias_regularizer": null, "name": "lstm_8", "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "recurrent_activation": "hard_sigmoid", "use_bias": true, "go_backwards": false, "kernel_constraint": null, "return_sequences": false, "dropout": 0.0, "bias_constraint": null, "stateful": false, "units": 64, "implementation": 0, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"name": "lstm_9", "inbound_nodes": [[["Price_lagged", 0, 0, {}]]], "class_name": "LSTM", "config": {"activity_regularizer": null, "unit_forget_bias": true, "trainable": true, "recurrent_dropout": 0.0, "unroll": false, "activation": "tanh", "recurrent_regularizer": null, "bias_regularizer": null, "name": "lstm_9", "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "recurrent_activation": "hard_sigmoid", "use_bias": true, "go_backwards": false, "kernel_constraint": null, "return_sequences": false, "dropout": 0.0, "bias_constraint": null, "stateful": false, "units": 64, "implementation": 0, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"name": "concatenate_3", "inbound_nodes": [[["lstm_7", 0, 0, {}], ["lstm_8", 0, 0, {}], ["lstm_9", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "axis": -1}}, {"name": "weighted_average_output", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "units": 10, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "weighted_average_output"}}], "input_layers": [["Volume_BTC", 0, 0], ["Bitcoin_Adj", 0, 0], ["Price_lagged", 0, 0]]}}